Конфигурация отчетов/DataProcessors/ТестированиеВВП_Рест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТестированиеВВП_Рест</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/Enums/Заведение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Заведение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заболотного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паустовского</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Таирово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филатово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дерибасовская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торговая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Люстдорф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПицерияЗаболотного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтерия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кондитерка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черноморск</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Documents/ЗаказТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказТовара</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныПриготовления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ид_Счета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗаказ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Catalogs/ЗоныПриготовления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗоныПриготовления</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ид_Стола</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/ТестированиеВВП_Рест/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ТовариИзШаблонаНаСервере()

	ТовариИзШаблона = ВВП.СписокТовараИзШаблона(Заведение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТовариИзШаблона(Команда)
	ТовариИзШаблонаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТокенНаСервере()

	Токен = ВВП.ПолучениеТокенаДоступа(Заведение); 

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТокен(Команда)
	ОбновитьТокенНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьНовыйСчетНаСервере()
	НомерСчета = ВВП.СоздатьНовыйСчет(Заведение, Ид_Стола);	 
	ВВП.ЗаписатьСчетВ_Регистр(Заведение,,НомерСчета,ТекущаяДата());
	Сообщить(НомерСчета);  
	//ВВП.ДобавитьНоменклатуруВСчет(Заведение, НомерСчета, Ид_Товара);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйСчет(Команда)
	СоздатьНовыйСчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьТоварВЗаказНаСервере()
	ВВП.ДобавитьНоменклатуруВСчет(Заведение, Ид_Счета, Ид_Товара);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварВЗаказ(Команда)
	ДобавитьТоварВЗаказНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаказ(Команда)
	ЗаполнитьЗаказНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказНаСервере()
	НомерСчета = ВВП.СоздатьНовыйСчет(Заведение, Ид_Стола);	 
	ВВП.ЗаписатьСчетВ_Регистр(Заведение,,НомерСчета,ТекущаяДата());   
	Заказ = ШаблонЗаполнения.ПолучитьОбъект();
	Для Каждого СтрокаЗаказа Из Заказ.Товар Цикл
		ВВП.ДобавитьНоменклатуруВСчет(Заведение, НомерСчета, Число(Формат(СтрокаЗаказа.Номенклатура.Код, "ЧГ=0")));
		Сообщить(СтрокаЗаказа.Номенклатура);	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСодержимоеСчетаНаСервере()
	ВВП.ПолутьСодержимоеСчета(Заведение, Ид_Счета);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСодержимоеСчета(Команда)
	ПолучитьСодержимоеСчетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьСозданиеНаСервере()
	
	ВВП.СозданиеСчетовИзШаблона(Заведение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСоздание(Команда)
	ЗапуститьСозданиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъеденитьЗаказыНаСервере()
	
	//ВВП.КонтролерЗапросов(Заведение, "ПолучениеВсехЗаказовСмены",,,,ТекущаяДата());

	//ВВП.ПолучениеВсехЗаказовСмены(Заведение, ТекущаяДата()); 
	ВВП.ОбработатьЗаказКухни(Заведение, ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ОбъеденитьЗаказы(Команда)
	ОбъеденитьЗаказыНаСервере();
	СоздатьПечатныйДокументНаСервере(Заведение, НачалоДня(ТекущаяДата()));
КонецПроцедуры

&НаСервере
Процедура ЗапуститьТестированиеНаСервере()
	Начало = ТекущаяДата();
	СтандартныеПараметры = ВВП.ПолучитьСтандартныеПараметры(Заведение);
	Для А=1 По КоличествоЦиклов Цикл
		ВВП.ПолучениеТокенаДоступаБезПараметров(Заведение);  
	КонецЦикла;
	Конец = ТекущаяДата();
	Сообщить(ВВП.ПолучитьРазностьВремени(Начало, Конец, "Секунда"));
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьТестирование(Команда)
	ЗапуститьТестированиеНаСервере();
КонецПроцедуры

&НаСервере
Функция  СоздатьПечатныйДокументНаСервере(Заведение, ДатаЗаказа)
	Таб = ПодготоваДанныхНаПечать(Заведение, ДатаЗаказа);
	Возврат СоздатьПечатныйДокументНакладной(Таб);
КонецФункции

Функция  СоздатьПечатныйДокументНакладной(СодержимоеДокумента) Экспорт   //возвращает строку - путь к созданому документу
	Если ТипЗнч(СодержимоеДокумента)<>Тип("ТаблицаЗначений") Тогда
		Возврат "";
	КонецЕсли;

	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетНакладнойНаПечать");   
	
	ТабДок.РазмерСтраницы = "A5";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	// Установка повторения шапки на каждом листе
	ТабДок.ПовторятьПриПечатиСтроки = ОбластьШапка;
	
	ТабДок.Вывести(ОбластьШапка);
	
	// Счетчик строк для переноса страницы
	СчетчикСтрок = 0;

	// Цикл по строкам таблицы
	Для Каждого Выборка Из СодержимоеДокумента Цикл
		ОбластьЗаказ = Макет.ПолучитьОбласть("ДетальнаяЗапись");
		ОбластьЗаказ.Параметры.Название = Выборка.Номенклатура;
	    ОбластьЗаказ.Параметры.Заказ = Строка(Выборка.Количество);  
		ОбластьЗаказ.Параметры.Коментарий = Выборка.Коментарий;

	    ТабДок.Вывести(ОбластьЗаказ);
	    
	    СчетчикСтрок = СчетчикСтрок + 1;
	    
	    // Перенос на новую страницу каждые 20 строк
	    Если СчетчикСтрок = 20 Тогда
	        ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	        СчетчикСтрок = 0; // Сброс счетчика
	    КонецЕсли;
	КонецЦикла; 
	
		// Сохранение в файл (например, PDF)
	Попытка
	    ТабДок.Записать("D:\Test folder\Печать накладной.pdf", ТипФайлаТабличногоДокумента.PDF);
		ВВП.ОтправкаФайлаВТГ("D:\Test folder\Печать накладной.pdf");
	Исключение
	    Сообщить("Ошибка при сохранении файла: " + ОписаниеОшибки());
	КонецПопытки;
		

	
	Возврат ТабДок;
	//ПоказатьОтчетНаСервере(ТабДок,Объект.Ссылка,0);
	
КонецФункции


Функция ПодготоваДанныхНаПечать(Заведение, ДатаЗаказа)
	ТабЗаказа = Новый ТаблицаЗначений;
	ТабЗаказа.Колонки.Добавить("Номенклатура");
	ТабЗаказа.Колонки.Добавить("Количество");  
	ТабЗаказа.Колонки.Добавить("Коментарий");       
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказТовараСписокЗаказ.Количество КАК Количество,
		|	ЗаказТовараСписокЗаказ.Номенклатура.Наименование КАК Номенклатура,
		|	ЗаказТовараСписокЗаказ.Коментарий КАК Коментарий
		|ИЗ
		|	Документ.ЗаказТовара.СписокЗаказ КАК ЗаказТовараСписокЗаказ
		|ГДЕ
		|	ЗаказТовараСписокЗаказ.Ссылка.Цех = &Цех
		|	И ЗаказТовараСписокЗаказ.Ссылка.Заведение = &Заведение
		|	И ЗаказТовараСписокЗаказ.Ссылка.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Цех", Справочники.ЗоныПриготовления.Общая);
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("Дата", ДатаЗаказа);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Данные = ТабЗаказа.Добавить();
		Данные.Номенклатура = Выборка.Номенклатура;
		Данные.Количество = Строка(Выборка.Количество);   
		Данные.Коментарий = Выборка.Коментарий;
	КонецЦикла;
	
	Возврат ТабЗаказа;
	
КонецФункции

&НаКлиенте
Процедура СоздатьПечатныйДокумент(Команда)
	ТабДок = СоздатьПечатныйДокументНаСервере(Заведение, НачалоДня(ТекущаяДата())); 
	ТабДок.Показать("МакетНакладнойНаПечать");

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заведение = Перечисления.Заведение.Заболотного;
КонецПроцедуры
